Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ1064DAR176.atdf
         <register caption="DDR Host Command 2 Register x (x = 0 through 15)" name="DDRCMD21" offset="0xc4" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="MDADDRHCMD" />
            <bitfield mask="0x00000700" name="BNKADDRCMD" />
            <bitfield mask="0x000FF800" name="WAIT" />
         </register>
         <register caption="DDR Host Command 2 Register x (x = 0 through 15)" name="DDRCMD22" offset="0xc8" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="MDADDRHCMD" />
            <bitfield mask="0x00000700" name="BNKADDRCMD" />
            <bitfield mask="0x000FF800" name="WAIT" />
         </register>
         <register caption="DDR Host Command 2 Register x (x = 0 through 15)" name="DDRCMD23" offset="0xcc" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="MDADDRHCMD" />
            <bitfield mask="0x00000700" name="BNKADDRCMD" />
            <bitfield mask="0x000FF800" name="WAIT" />
         </register>
         <register caption="DDR Host Command 2 Register x (x = 0 through 15)" name="DDRCMD24" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="MDADDRHCMD" />
            <bitfield mask="0x00000700" name="BNKADDRCMD" />
            <bitfield mask="0x000FF800" name="WAIT" />
         </register>
         <register caption="DDR Host Command 2 Register x (x = 0 through 15)" name="DDRCMD25" offset="0xd4" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="MDADDRHCMD" />
            <bitfield mask="0x00000700" name="BNKADDRCMD" />
            <bitfield mask="0x000FF800" name="WAIT" />
         </register>
         <register caption="DDR Host Command 2 Register x (x = 0 through 15)" name="DDRCMD26" offset="0xd8" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="MDADDRHCMD" />
            <bitfield mask="0x00000700" name="BNKADDRCMD" />
            <bitfield mask="0x000FF800" name="WAIT" />
         </register>
         <register caption="DDR Host Command 2 Register x (x = 0 through 15)" name="DDRCMD27" offset="0xdc" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="MDADDRHCMD" />
            <bitfield mask="0x00000700" name="BNKADDRCMD" />
            <bitfield mask="0x000FF800" name="WAIT" />
         </register>
         <register caption="DDR Host Command 2 Register x (x = 0 through 15)" name="DDRCMD28" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="MDADDRHCMD" />
            <bitfield mask="0x00000700" name="BNKADDRCMD" />
            <bitfield mask="0x000FF800" name="WAIT" />
         </register>
         <register caption="DDR Host Command 2 Register x (x = 0 through 15)" name="DDRCMD29" offset="0xe4" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="MDADDRHCMD" />
            <bitfield mask="0x00000700" name="BNKADDRCMD" />
            <bitfield mask="0x000FF800" name="WAIT" />
         </register>
         <register caption="DDR Host Command 2 Register x (x = 0 through 15)" name="DDRCMD210" offset="0xe8" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="MDADDRHCMD" />
            <bitfield mask="0x00000700" name="BNKADDRCMD" />
            <bitfield mask="0x000FF800" name="WAIT" />
         </register>
         <register caption="DDR Host Command 2 Register x (x = 0 through 15)" name="DDRCMD211" offset="0xec" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="MDADDRHCMD" />
            <bitfield mask="0x00000700" name="BNKADDRCMD" />
            <bitfield mask="0x000FF800" name="WAIT" />
         </register>
         <register caption="DDR Host Command 2 Register x (x = 0 through 15)" name="DDRCMD212" offset="0xf0" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="MDADDRHCMD" />
            <bitfield mask="0x00000700" name="BNKADDRCMD" />
            <bitfield mask="0x000FF800" name="WAIT" />
         </register>
         <register caption="DDR Host Command 2 Register x (x = 0 through 15)" name="DDRCMD213" offset="0xf4" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="MDADDRHCMD" />
            <bitfield mask="0x00000700" name="BNKADDRCMD" />
            <bitfield mask="0x000FF800" name="WAIT" />
         </register>
         <register caption="DDR Host Command 2 Register x (x = 0 through 15)" name="DDRCMD214" offset="0xf8" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="MDADDRHCMD" />
            <bitfield mask="0x00000700" name="BNKADDRCMD" />
            <bitfield mask="0x000FF800" name="WAIT" />
         </register>
         <register caption="DDR Host Command 2 Register x (x = 0 through 15)" name="DDRCMD215" offset="0xfc" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="MDADDRHCMD" />
            <bitfield mask="0x00000700" name="BNKADDRCMD" />
            <bitfield mask="0x000FF800" name="WAIT" />
         </register>
      </register-group>
      <value-group caption="Memory Initialize Start bit" name="DDRMEMCON__STINIT">
         <value caption="Start memory initialization" name="" value="0x1" />
         <value caption="Do not start memory initialization" name="" value="0x0" />
      </value-group>
      <value-group caption="Memory Initialize Done bit" name="DDRMEMCON__INITDN">
         <value caption="All commands have been issued; the controller is enabled for regular operation" name="" value="0x1" />
         <value caption="Controller not enabled for regular operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Automatic Precharge Enable bit" name="DDRMEMCFG0__APCHRGEN">
         <value caption="Issue an auto-precharged command" name="" value="0x1" />
         <value caption="Do not issue an auto-precharged command" name="" value="0x0" />
      </value-group>
      <value-group caption="Automatic Power Down Enable bit" name="DDRPWRCFG__APWRDNEN">
         <value caption="Allow automatic entry into Power Down mode." name="" value="0x1" />
         <value caption="Do not allow automatic entry into Power Down mode." name="" value="0x0" />
      </value-group>
