Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ1064DAR176.atdf
         <register caption="Ethernet Controller TX Packet Descriptor Start Address Register" name="ETHTXST" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFC" name="TXSTADDR" />
         </register>
         <register caption="Ethernet Controller RX Packet Descriptor Start Address Register" name="ETHRXST" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFC" name="RXSTADDR" />
         </register>
         <register caption="Ethernet Controller Hash Table 0 Register" name="ETHHT0" offset="0x40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="HT" />
         </register>
         <register caption="Ethernet Controller Hash Table 1 Register" name="ETHHT1" offset="0x50" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="HT" />
         </register>
         <register caption="Ethernet Controller Pattern Match Mask 0 Register" name="ETHPMM0" offset="0x60" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PMM" />
         </register>
         <register caption="Ethernet Controller Pattern Match Mask 1 Register" name="ETHPMM1" offset="0x70" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PMM" />
         </register>
         <register caption="Ethernet Controller Pattern Match Checksum Register" name="ETHPMCS" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PMCS" />
         </register>
         <register caption="Ethernet Controller Pattern Match Offset Register" name="ETHPMO" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="PMO" />
         </register>
         <register caption="Ethernet Controller Receive Filter Configuration Register" name="ETHRXFC" offset="0xa0" rw="RW" size="4">
            <bitfield caption="Broadcast Enable bit" mask="0x00000001" name="BCEN" values="ETHRXFC__BCEN" />
            <bitfield caption="Multicast Enable bit" mask="0x00000002" name="MCEN" values="ETHRXFC__MCEN" />
            <bitfield caption="Not Me Unicast Enable bit" mask="0x00000004" name="NOTMEEN" values="ETHRXFC__NOTMEEN" />
            <bitfield caption="Unicast Enable bit" mask="0x00000008" name="UCEN" values="ETHRXFC__UCEN" />
            <bitfield caption="Runt Enable bit" mask="0x00000010" name="RUNTEN" values="ETHRXFC__RUNTEN" />
            <bitfield caption="Runt Error Collection Enable bit" mask="0x00000020" name="RUNTERREN" values="ETHRXFC__RUNTERREN" />
            <bitfield caption="CRC OK Enable bit" mask="0x00000040" name="CRCOKEN" values="ETHRXFC__CRCOKEN" />
            <bitfield caption="CRC Error Collection Enable bit" mask="0x00000080" name="CRCERREN" values="ETHRXFC__CRCERREN" />
            <bitfield caption="Pattern Match Mode bits" mask="0x00000F00" name="PMMODE" values="ETHRXFC__PMMODE" />
            <bitfield caption="Pattern Match Inversion bit" mask="0x00001000" name="NOTPM" values="ETHRXFC__NOTPM" />
            <bitfield caption="Magic Packet Enable bit" mask="0x00004000" name="MPEN" values="ETHRXFC__MPEN" />
            <bitfield caption="Enable Hash Table Filtering bit" mask="0x00008000" name="HTEN" values="ETHRXFC__HTEN" />
         </register>
         <register caption="Ethernet Controller Receive Watermarks Register" name="ETHRXWM" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x000000FF" name="RXEWM" />
            <bitfield mask="0x00FF0000" name="RXFWM" />
         </register>
         <register caption="Ethernet Controller Interrupt Enable Register" name="ETHIEN" offset="0xc0" rw="RW" size="4">
            <bitfield caption="Receive FIFO Overflow Interrupt Enable bit" mask="0x00000001" name="RXOVFLWIE" values="ETHIEN__RXOVFLWIE" />
            <bitfield caption="Receive Buffer Not Available Interrupt Enable bit" mask="0x00000002" name="RXBUFNAIE" values="ETHIEN__RXBUFNAIE" />
            <bitfield caption="Transmitter Abort Interrupt Enable bit" mask="0x00000004" name="TXABORTIE" values="ETHIEN__TXABORTIE" />
            <bitfield caption="Transmitter Done Interrupt Enable bit" mask="0x00000008" name="TXDONEIE" values="ETHIEN__TXDONEIE" />
            <bitfield caption="RX Activity Interrupt Enable bit" mask="0x00000020" name="RXACTIE" values="ETHIEN__RXACTIE" />
            <bitfield caption="Packet Pending Interrupt Enable bit" mask="0x00000040" name="PKTPENDIE" values="ETHIEN__PKTPENDIE" />
            <bitfield caption="Receiver Done Interrupt Enable bit" mask="0x00000080" name="RXDONEIE" values="ETHIEN__RXDONEIE" />
            <bitfield caption="Full Watermark Interrupt Enable bit" mask="0x00000100" name="FWMARKIE" values="ETHIEN__FWMARKIE" />
            <bitfield caption="Empty Watermark Interrupt Enable bit" mask="0x00000200" name="EWMARKIE" values="ETHIEN__EWMARKIE" />
            <bitfield caption="Receive BVCI Bus Error Interrupt Enable bit" mask="0x00002000" name="RXBUSEIE" values="ETHIEN__RXBUSEIE" />
            <bitfield caption="Transmit BVCI Bus Error Interrupt Enable bit" mask="0x00004000" name="TXBUSEIE" values="ETHIEN__TXBUSEIE" />
         </register>
         <register caption="Ethernet Controller Interrupt Request Register" name="ETHIRQ" offset="0xd0" rw="RW" size="4">
            <bitfield caption="Receive FIFO Over Flow Error bit" mask="0x00000001" name="RXOVFLW" values="ETHIRQ__RXOVFLW" />
            <bitfield caption="Receive Buffer Not Available Interrupt bit" mask="0x00000002" name="RXBUFNA" values="ETHIRQ__RXBUFNA" />
            <bitfield caption="Transmit Abort Condition Interrupt bit" mask="0x00000004" name="TXABORT" values="ETHIRQ__TXABORT" />
            <bitfield caption="Transmit Done Interrupt bit" mask="0x00000008" name="TXDONE" values="ETHIRQ__TXDONE" />
            <bitfield caption="Receive Activity Interrupt bit" mask="0x00000020" name="RXACT" values="ETHIRQ__RXACT" />
            <bitfield caption="Packet Pending Interrupt bit" mask="0x00000040" name="PKTPEND" values="ETHIRQ__PKTPEND" />
            <bitfield caption="Receive Done Interrupt bit" mask="0x00000080" name="RXDONE" values="ETHIRQ__RXDONE" />
            <bitfield caption="Full Watermark Interrupt bit" mask="0x00000100" name="FWMARK" values="ETHIRQ__FWMARK" />
            <bitfield caption="Empty Watermark Interrupt bit" mask="0x00000200" name="EWMARK" values="ETHIRQ__EWMARK" />
            <bitfield caption="Receive BVCI Bus Error Interrupt bit" mask="0x00002000" name="RXBUSE" values="ETHIRQ__RXBUSE" />
            <bitfield caption="Transmit BVCI Bus Error Interrupt bit" mask="0x00004000" name="TXBUSE" values="ETHIRQ__TXBUSE" />
         </register>
