Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ1064DAR176.atdf
         <register caption="" name="GLCDCURDATA102" offset="0x998" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2523" />
            <bitfield mask="0x000000F0" name="PIXEL2522" />
            <bitfield mask="0x00000F00" name="PIXEL2521" />
            <bitfield mask="0x0000F000" name="PIXEL2520" />
            <bitfield mask="0x000F0000" name="PIXEL2519" />
            <bitfield mask="0x00F00000" name="PIXEL2518" />
            <bitfield mask="0x0F000000" name="PIXEL2517" />
            <bitfield mask="0xF0000000" name="PIXEL2516" />
         </register>
         <register caption="" name="GLCDCURDATA103" offset="0x99C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2531" />
            <bitfield mask="0x000000F0" name="PIXEL2530" />
            <bitfield mask="0x00000F00" name="PIXEL2529" />
            <bitfield mask="0x0000F000" name="PIXEL2528" />
            <bitfield mask="0x000F0000" name="PIXEL2527" />
            <bitfield mask="0x00F00000" name="PIXEL2526" />
            <bitfield mask="0x0F000000" name="PIXEL2525" />
            <bitfield mask="0xF0000000" name="PIXEL2524" />
         </register>
         <register caption="" name="GLCDCURDATA104" offset="0x9A0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL267" />
            <bitfield mask="0x000000F0" name="PIXEL266" />
            <bitfield mask="0x00000F00" name="PIXEL265" />
            <bitfield mask="0x0000F000" name="PIXEL264" />
            <bitfield mask="0x000F0000" name="PIXEL263" />
            <bitfield mask="0x00F00000" name="PIXEL262" />
            <bitfield mask="0x0F000000" name="PIXEL261" />
            <bitfield mask="0xF0000000" name="PIXEL260" />
         </register>
         <register caption="" name="GLCDCURDATA105" offset="0x9A4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2615" />
            <bitfield mask="0x000000F0" name="PIXEL2614" />
            <bitfield mask="0x00000F00" name="PIXEL2613" />
            <bitfield mask="0x0000F000" name="PIXEL2612" />
            <bitfield mask="0x000F0000" name="PIXEL2611" />
            <bitfield mask="0x00F00000" name="PIXEL2610" />
            <bitfield mask="0x0F000000" name="PIXEL269" />
            <bitfield mask="0xF0000000" name="PIXEL268" />
         </register>
         <register caption="" name="GLCDCURDATA106" offset="0x9A8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2623" />
            <bitfield mask="0x000000F0" name="PIXEL2622" />
            <bitfield mask="0x00000F00" name="PIXEL2621" />
            <bitfield mask="0x0000F000" name="PIXEL2620" />
            <bitfield mask="0x000F0000" name="PIXEL2619" />
            <bitfield mask="0x00F00000" name="PIXEL2618" />
            <bitfield mask="0x0F000000" name="PIXEL2617" />
            <bitfield mask="0xF0000000" name="PIXEL2616" />
         </register>
         <register caption="" name="GLCDCURDATA107" offset="0x9AC" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2631" />
            <bitfield mask="0x000000F0" name="PIXEL2630" />
            <bitfield mask="0x00000F00" name="PIXEL2629" />
            <bitfield mask="0x0000F000" name="PIXEL2628" />
            <bitfield mask="0x000F0000" name="PIXEL2627" />
            <bitfield mask="0x00F00000" name="PIXEL2626" />
            <bitfield mask="0x0F000000" name="PIXEL2625" />
            <bitfield mask="0xF0000000" name="PIXEL2624" />
         </register>
         <register caption="" name="GLCDCURDATA108" offset="0x9B0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL277" />
            <bitfield mask="0x000000F0" name="PIXEL276" />
            <bitfield mask="0x00000F00" name="PIXEL275" />
            <bitfield mask="0x0000F000" name="PIXEL274" />
            <bitfield mask="0x000F0000" name="PIXEL273" />
            <bitfield mask="0x00F00000" name="PIXEL272" />
            <bitfield mask="0x0F000000" name="PIXEL271" />
            <bitfield mask="0xF0000000" name="PIXEL270" />
         </register>
         <register caption="" name="GLCDCURDATA109" offset="0x9B4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2715" />
            <bitfield mask="0x000000F0" name="PIXEL2714" />
            <bitfield mask="0x00000F00" name="PIXEL2713" />
            <bitfield mask="0x0000F000" name="PIXEL2712" />
            <bitfield mask="0x000F0000" name="PIXEL2711" />
            <bitfield mask="0x00F00000" name="PIXEL2710" />
            <bitfield mask="0x0F000000" name="PIXEL279" />
            <bitfield mask="0xF0000000" name="PIXEL278" />
         </register>
         <register caption="" name="GLCDCURDATA110" offset="0x9B8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2723" />
            <bitfield mask="0x000000F0" name="PIXEL2722" />
            <bitfield mask="0x00000F00" name="PIXEL2721" />
            <bitfield mask="0x0000F000" name="PIXEL2720" />
            <bitfield mask="0x000F0000" name="PIXEL2719" />
            <bitfield mask="0x00F00000" name="PIXEL2718" />
            <bitfield mask="0x0F000000" name="PIXEL2717" />
            <bitfield mask="0xF0000000" name="PIXEL2716" />
         </register>
         <register caption="" name="GLCDCURDATA111" offset="0x9BC" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2731" />
            <bitfield mask="0x000000F0" name="PIXEL2730" />
            <bitfield mask="0x00000F00" name="PIXEL2729" />
            <bitfield mask="0x0000F000" name="PIXEL2728" />
            <bitfield mask="0x000F0000" name="PIXEL2727" />
            <bitfield mask="0x00F00000" name="PIXEL2726" />
            <bitfield mask="0x0F000000" name="PIXEL2725" />
            <bitfield mask="0xF0000000" name="PIXEL2724" />
         </register>
         <register caption="" name="GLCDCURDATA112" offset="0x9C0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL287" />
            <bitfield mask="0x000000F0" name="PIXEL286" />
            <bitfield mask="0x00000F00" name="PIXEL285" />
            <bitfield mask="0x0000F000" name="PIXEL284" />
            <bitfield mask="0x000F0000" name="PIXEL283" />
            <bitfield mask="0x00F00000" name="PIXEL282" />
            <bitfield mask="0x0F000000" name="PIXEL281" />
            <bitfield mask="0xF0000000" name="PIXEL280" />
         </register>
